tap 'homebrew/services'
tap 'caskroom/fonts'

brew 'git'
brew 'hr'
brew 'mas'
brew 'node'
brew 'pidof'
brew 'rbenv'
brew 'ruby-build'

mas 'Name Mangler 3', id: 603637384
mas 'Temperature Gauge', id: 467830521
mas 'The Unarchiver', id: 425424353

cask 'appcleaner'
cask 'backblaze'
cask 'mplayerx'
cask 'pdfinfo'
cask 'transmission'
cask 'xld'

