brew 'base64'
brew 'git'
brew 'hr'
brew 'imagemagick'
brew 'lame'
brew 'lynx'
brew 'mas'
brew 'nginx'
brew 'nmap'
brew 'node'
brew 'pidof'
brew 'postgresql'
brew 'rbenv'
brew 'ruby-build'
brew 'youtube-dl'
brew 'zsh'

mas '1Password', id: 443987910
mas 'Airmail 3', id: 918858936
mas 'Byword', id: 420212497
mas 'Clear', id: 504544917
mas 'CloudApp', id: 417602904
mas 'Deliveries', id: 924726344
mas 'Fantastical 2', id: 975937182
mas 'Icon Slate', id: 439697913
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Marked 2', id: 890031187
mas 'Monity', id: 915542151
mas 'Moom', id: 419330170
mas 'Name Mangler 3', id: 603637384
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Patterns', id: 429449079
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941

cask 'alfred'
cask 'appcleaner'
cask 'atom'
cask 'firefox'
cask 'fluid'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'karabiner'
cask 'mplayerx'
cask 'onyx'
cask 'opera'
cask 'padbury-clock'
cask 'pdfinfo'
cask 'psequel'
cask 'seil'
cask 'sketch'
