tap 'homebrew/services'
tap 'caskroom/drivers'
tap 'caskroom/fonts'

brew 'ansible'
brew 'base64'
brew 'fd'
brew 'ffmpeg'
brew 'git'
brew 'hr'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'lame'
brew 'lynx'
brew 'm-cli'
brew 'mas'
brew 'nano'
brew 'nginx'
brew 'nmap'
brew 'pandoc'
brew 'pidof'
brew 'postgresql'
brew 'rbenv'
brew 'ruby-build'
brew 'screen'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'yarn', args: ['--without-node']
brew 'ykman'
brew 'youtube-dl'

mas '1Password', id: 443987910
mas 'Airmail 3', id: 918858936
mas 'Bear', id: 1091189122
mas 'Clear', id: 504544917
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'Fantastical 2', id: 975937182
mas 'Icon Slate', id: 439697913
mas 'iMovie', id: 408981434
mas 'Keypad', id: 928906884
mas 'Keynote', id: 409183694
mas 'Marked 2', id: 890031187
mas 'Monity', id: 915542151
mas 'Moom', id: 419330170
mas 'Name Mangler 3', id: 603637384
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Patterns', id: 429449079
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941

cask 'alfred'
cask 'appcleaner'
cask 'atom'
cask 'devdocs'
cask 'encryptme'
cask 'etcher'
cask 'firefox'
cask 'fission'
cask 'google-chrome'
cask 'handbrake'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia'
cask 'mplayerx'
cask 'monity-helper'
cask 'onyx'
cask 'opera'
cask 'padbury-clock'
cask 'psequel'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'signal'
cask 'sketch'
cask 'touchswitcher'
cask 'transmit'
cask 'vmware-fusion'
cask 'yubico-yubikey-piv-manager'
