#!/usr/bin/env zsh

# Local plugins
${XDG_CONFIG_HOME}/zsh/.aliases

# zsh-plugins - https://codeberg.org/jgarber/zsh-plugins
https://codeberg.org/jgarber/zsh-plugins path:orbstack
https://codeberg.org/jgarber/zsh-plugins path:rbenv kind:defer
https://codeberg.org/jgarber/zsh-plugins path:secretive
https://codeberg.org/jgarber/zsh-plugins path:starship

# `cd` up any number of directories - https://github.com/peterhurford/up.zsh
peterhurford/up.zsh

# oh-my-zsh - https://github.com/ohmyzsh/ohmyzsh
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/gcloud kind:defer
ohmyzsh/ohmyzsh path:plugins/gpg-agent kind:defer
ohmyzsh/ohmyzsh path:plugins/nvm kind:defer
ohmyzsh/ohmyzsh path:plugins/urltools

# zsh-utils - https://github.com/belak/zsh-utils
belak/zsh-utils path:history

# Completions
Homebrew/brew path:completions/zsh kind:fpath
zsh-users/zsh-completions
belak/zsh-utils path:completion

# zsh-users - https://github.com/zsh-users
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search kind:defer
